|Step|Status|
|:---|:---|
|🖌 - Format and Style|Failed|
|⚙️ - Initialization|Success|
|🤖 - Validation|Success|
|📖 - Plan|Success|

## Terraform Plan
<details><summary>Show Plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bootstrap_cicd_aws_codebuild.aws_codebuild_project.terraform_apply has changed
  ~ resource "aws_codebuild_project" "terraform_apply" {
        id                     = "arn:aws:codebuild:us-east-2:506279660399:project/terraform-apply"
        name                   = "terraform-apply"
      + tags                   = {}
        # (15 unchanged attributes hidden)

      ~ cache {
          + modes    = []
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.bootstrap_cicd_aws_codebuild.aws_codebuild_project.terraform_plan has changed
  ~ resource "aws_codebuild_project" "terraform_plan" {
        id                     = "arn:aws:codebuild:us-east-2:506279660399:project/terraform-plan"
        name                   = "terraform-plan"
      + tags                   = {}
        # (15 unchanged attributes hidden)

      ~ cache {
          + modes    = []
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.budget_billing_alert.aws_budgets_budget.total_spend will be created
  + resource "aws_budgets_budget" "total_spend" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "10"
      + limit_unit        = "USD"
      + name              = "budget-monthly"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Module" = "build-on-aws/terraform-samples/modules/bootstrap-aws-account"
          + "Name"   = "tf-bootstrap"
        }
      + tags_all          = {
          + "Module" = "build-on-aws/terraform-samples/modules/bootstrap-aws-account"
          + "Name"   = "tf-bootstrap"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "MONTHLY"

      + cost_filter (known after apply)

      + cost_types (known after apply)

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "FORECASTED"
          + subscriber_email_addresses = [
              + "felipe.archangelo@gmail.com",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 75
          + threshold_type             = "PERCENTAGE"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

*Author: @fearchangelo, Action: pr/1*